#Дан список заполненный произвольными целыми числами.
#Получите новый список, элементами которого будут только уникальные элементы исходного.

my_list_1 = [2, 2, 8, 220, 99, 5, 145, 220, 12, 8, 2, 12, 99, 5, 7, 145]

i = 0
while i < my_list_1
print()

#new_list = set(my_list_1)
#print(new_list)